Repository: Rusk0m/franch_hub
Catalog: lib/l10n/intl_*.arb
Languages: be, ru

# signUpError
source: Sign up error: {error}
be: Памылка рэгістрацыі: {error}
ru: Ошибка регистрации: {error}

# loginError
source: Login error: {error}
be: Памылка ўваходу: {error}
ru: Ошибка входа: {error}

# googleLoginError
source: Google login error: {error}
be: Памылка ўваходу праз Google: {error}
ru: Ошибка входа через Google: {error}

# logoutError
source: Logout error: {error}
be: Памылка выхаду: {error}
ru: Ошибка выхода: {error}

# authCheckError
source: Authentication check error: {error}
be: Памылка праверкі аўтарызацыі: {error}
ru: Ошибка проверки авторизации: {error}

source: User not found
be: Карыстальнік не знойдзены
ru: Пользователь не найден

# fetchUserError
source: Failed to fetch user: {error}
be: Не ўдалося атрымаць дадзеныя карыстальніка: {error}
ru: Не удалось получить данные пользователя: {error}

source: User creation failed
be: Не ўдалося стварыць карыстальніка
ru: Не удалось создать пользователя

# unknownError
source: An unknown exception occurred.
be: Адбылася невядомая памылка.
ru: Произошла неизвестная ошибка.

# invalidEmail
source: Email is not valid or badly formatted.
be: Электронная пошта несапраўдная або няправільна адфарматаваная.
ru: Электронная почта недействительна или неправильно отформатирована.

# emailAlreadyInUse
source: An account already exists for that email.
be: Акаўнт з гэтай электроннай поштай ужо існуе.
ru: Аккаунт с этой электронной почтой уже существует.

# operationNotAllowed
source: Operation is not allowed. Please contact support.
be: Аперацыя не дазволена. Звярніцеся ў падтрымку.
ru: Операция не разрешена. Обратитесь в поддержку.

# weakPassword
source: Please enter a stronger password.
be: Увядзіце больш надзейны пароль.
ru: Введите более надежный пароль.

# userDisabled
source: This user has been disabled. Please contact support for help.
be: Гэты карыстальнік заблакаваны. Звярніцеся ў падтрымку.
ru: Этот пользователь заблокирован. Обратитесь в поддержку.

# emailNotFound
source: Email is not found, please create an account.
be: Электронная пошта не знойдзена, стварыце акаўнт.
ru: Электронная почта не найдена, создайте аккаунт.

# wrongPassword
source: Incorrect password, please try again.
be: Няправільны пароль, паспрабуйце зноў.
ru: Неверный пароль, попробуйте снова.

# accountExistsDifferentCredential
source: Account exists with different credentials.
be: Акаўнт існуе з іншымі ўліковымі дадзенымі.
ru: Аккаунт существует с другими учетными данными.

# invalidCredential
source: The credential received is malformed or has expired.
be: Атрыманыя ўліковыя дадзеныя няправільныя або скончыліся.
ru: Полученные учетные данные неверны или истекли.

# invalidVerificationCode
source: The credential verification code received is invalid.
be: Код вэрыфікацыі ўліковых дадзеных несапраўдны.
ru: Код верификации учетных данных недействителен.

# invalidVerificationId
source: The credential verification ID received is invalid.
be: ID вэрыфікацыі ўліковых дадзеных несапраўдны.
ru: ID верификации учетных данных недействителен.

source: Welcome Back!
be: З вяртаннем!
ru: С возвращением!

# createNewAccount
source: Create a new account
be: Стварыць новы акаўнт
ru: Создать новый аккаунт

# signInAccount
source: Sign in your account
be: Увайдзіце ў свой акаўнт
ru: Войдите в свой аккаунт

# usernameLabel
source: Username
be: Імя карыстальніка
ru: Имя пользователя

# emailLabel
source: Email
be: Электронная пошта
ru: Электронная почта

# passwordLabel
source: Password
be: Пароль
ru: Пароль

source: Forgot password?
be: Забылі пароль?
ru: Забыли пароль?

# registrationButton
source: Registration
be: Рэгістрацыя
ru: Регистрация

# loginButton
source: Login
be: Уваход
ru: Вход

source: Or Continue With
be: Або працягнуць з
ru: Или продолжить с

# alreadyHaveAccount
source: Already have an account?
be: Ужо ёсць акаўнт?
ru: Уже есть аккаунт?

# notRegisteredUser
source: Not a registered user?
be: Не зарэгістраваны карыстальнік?
ru: Не зарегистрированный пользователь?

# logInLink
source: LogIn!
be: Увайсці!
ru: Войти!

# registerNowLink
source: Register Now!
be: Зарэгістравацца зараз!
ru: Зарегистрироваться сейчас!

source: Error: {message}
be: Памылка: {message}
ru: Ошибка: {message}

# franchiseBranchesTitle
source: Franchise branches: {franchiseName}
be: Філіялы франшызы: {franchiseName}
ru: Филиалы франшизы: {franchiseName}

# myBranchesTitle
source: My branches
be: Мае філіялы
ru: Мои филиалы

# addBranchTitle
source: Add branch
be: Дадаць філіял
ru: Добавить филиал

# createBranchRequestTitle
source: Create branch request
be: Стварыць запыт на філіял
ru: Создать запрос на филиал

# editBranchTitle
source: Edit branch
be: Рэдагаваць філіял
ru: Редактировать филиал

# branchNameLabel
source: Branch name
be: Назва філіяла
ru: Название филиала

# enterNameError
source: Please enter a name
be: Увядзіце назву
ru: Введите название

# enterLocationError
source: Please enter an address
be: Увядзіце адрас
ru: Введите адрес

# enterRoyaltyError
source: Please enter royalty
be: Увядзіце раялці
ru: Введите роялти

# invalidRoyaltyError
source: Please enter a valid number
be: Увядзіце сапраўднае лік
ru: Введите действительное число

# enterWorkingHoursError
source: Please enter working hours
be: Увядзіце гадзіны працы
ru: Введите часы работы

# enterPhoneError
source: Please enter a phone number
be: Увядзіце нумар тэлефона
ru: Введите номер телефона

# sendRequestButton
source: Send request
be: Адправіць запыт
ru: Отправить запрос

# addBranchButton
source: Add branch
be: Дадаць філіял
ru: Добавить филиал

# saveChangesButton
source: Save changes
be: Захаваць змены
ru: Сохранить изменения

# noBranchesMessage
source: This franchise has no branches yet.
be: Гэтая франшыза пакуль не мае філіялаў.
ru: У этой франшизы пока нет филиалов.

# noUserBranchesMessage
source: You don't have any branches yet.
be: У вас пакуль няма філіялаў.
ru: У вас пока нет филиалов.

# pendingRequestsTitle
source: Pending requests
be: Чакаючыя запыты
ru: Ожидающие запросы

# statusLabel
source: Status: {status}
be: Статус: {status}
ru: Статус: {status}

# deleteBranchDialogTitle
source: Delete branch?
be: Выдаліць філіял?
ru: Удалить филиал?

# deleteBranchDialogContent
source: Are you sure you want to delete "{branchName}"?
be: Вы ўпэўнены, што хочаце выдаліць "{branchName}"?
ru: Вы уверены, что хотите удалить "{branchName}"?

# cancelButton
source: Cancel
be: Адмяніць
ru: Отмена

# deleteButton
source: Delete
be: Выдаліць
ru: Удалить

# backButton
source: Back
be: Назад
ru: Назад

# operationSuccessMessage
source: Operation completed successfully
be: Аперацыя паспяхова завершана
ru: Операция успешно завершена

# branchRequestSentMessage
source: Request sent for moderation
be: Запыт адпраўлены на мадэрацыю
ru: Запрос отправлен на модерацию

# branchAddedMessage
source: Branch added successfully
be: Філіял паспяхова дададзены
ru: Филиал успешно добавлен

# branchUpdatedMessage
source: Branch updated successfully
be: Філіял паспяхова абноўлены
ru: Филиал успешно обновлен

# newBranchRequest
source: New branch request: {branchName} by {requesterId}
be: Новы запыт на філіял: {branchName} ад {requesterId}
ru: Новый запрос на филиал: {branchName} от {requesterId}

# branchRequestApproved
source: Branch request approved: {branchName}
be: Запыт на філіял зацверджаны: {branchName}
ru: Запрос на филиал одобрен: {branchName}

# franchiseDataError
source: Error: Franchise data not provided
be: Памылка: Дадзеныя франшызы не прадастаўлены
ru: Ошибка: Данные франшизы не предоставлены

# failedToCreatePendingBranch
source: Failed to create pending branch: {error}
be: Не ўдалося стварыць чакаючы філіял: {error}
ru: Не удалось создать ожидающий филиал: {error}

# failedToLoadBranches
source: Failed to load branches: {error}
be: Не ўдалося загрузіць філіялы: {error}
ru: Не удалось загрузить филиалы: {error}

# failedToAddBranch
source: Failed to add branch: {error}
be: Не ўдалося дадаць філіял: {error}
ru: Не удалось добавить филиал: {error}

# failedToDeleteBranch
source: Failed to delete branch: {error}
be: Не ўдалося выдаліць філіял: {error}
ru: Не удалось удалить филиал: {error}

# failedToEditBranch
source: Failed to edit branch: {error}
be: Не ўдалося адрэдагаваць філіял: {error}
ru: Не удалось отредактировать филиал: {error}

# failedToModerateBranch
source: Failed to moderate branch: {error}
be: Не ўдалося мадэраваць філіял: {error}
ru: Не удалось модерировать филиал: {error}

# reportsTab
source: Reports
be: Справаздачы
ru: Отчеты

# transactionsTab
source: Transactions
be: Транзакцыі
ru: Транзакции

# branchInfo
source: Address: {location} Working hours: {workingHours} Phone: {phone}
be: Адрас: {location} Гадзіны працы: {workingHours} Тэлефон: {phone}
ru: Адрес: {location} Часы работы: {workingHours} Телефон: {phone}

source: Waiting for data...
be: Чаканне дадзеных...
ru: Ожидание данных...

# branchNotFoundError
source: The branch you are trying to edit no longer exists.
be: Філіял, які вы спрабуеце адрэдагаваць, больш не існуе.
ru: Филиал, который вы пытаетесь отредактировать, больше не существует.

# chatPageTitle
source: Chat with {userName}
be: Чат з {userName}
ru: Чат с {userName}

# typeMessageHint
source: Type a message...
be: Увядзіце паведамленне...
ru: Введите сообщение...

source: No messages yet
be: Паведамленняў пакуль няма
ru: Сообщений пока нет

# chatError
source: Error: {message}
be: Памылка: {message}
ru: Ошибка: {message}

# selectUserToChatTitle
source: Select User to Chat
be: Выберыце карыстальніка для чата
ru: Выберите пользователя для чата

source: Please log in to view users
be: Калі ласка, увайдзіце, каб праглядзець карыстальнікаў
ru: Пожалуйста, войдите, чтобы просмотреть пользователей

source: No users found
be: Карыстальнікі не знойдзены
ru: Пользователи не найдены

# branchReportsTitle
source: Branch reports
be: Справаздачы філіяла
ru: Отчеты филиала

source: No reports available
be: Справаздачы адсутнічаюць
ru: Отчеты отсутствуют

# reportDetailsTitle
source: Report details {month}/{year}
be: Дэталі справаздачы {month}/{year}
ru: Детали отчета {month}/{year}

# revenueLabel
source: Revenue
be: Выручка
ru: Выручка

# netProfitLabel
source: Net profit
be: Чысты прыбытак
ru: Чистая прибыль

# totalAssetsLabel
source: Total assets
be: Агульныя актывы
ru: Общие активы

# ownCapitalLabel
source: Own capital
be: Уласны капітал
ru: Собственный капитал

# liabilitiesLabel
source: Liabilities
be: Абавязкі
ru: Обязательства

# inventoryLabel
source: Inventory
be: Запасы
ru: Запасы

# initialInvestmentLabel
source: Initial investment
be: Пачатковыя інвестыцыі
ru: Начальные инвестиции

# fixedCostsLabel
source: Fixed costs
be: Фіксаваныя выдаткі
ru: Фиксированные затраты

# unitPriceLabel
source: Unit price
be: Цана за адзінку
ru: Цена за единицу

# variableCostsLabel
source: Variable costs
be: Пераменныя выдаткі
ru: Переменные затраты

# cashInflowLabel
source: Cash inflow
be: Прыток грашовых сродкаў
ru: Приток денежных средств

# cashOutflowLabel
source: Cash outflow
be: Адток грашовых сродкаў
ru: Отток денежных средств

# royaltyPercentLabelReport
source: Royalty (%)
be: Раялці (%)
ru: Роялти (%)

# closeButton
source: Close
be: Зачыніць
ru: Закрыть

# branchIndicatorsTitle
source: Branch indicators
be: Паказчыкі філіяла
ru: Показатели филиала

source: No indicators data
be: Дадзеныя па паказчыках адсутнічаюць
ru: Данные по показателям отсутствуют

source: ROI by months
be: ROI па месяцах
ru: ROI по месяцам

# indicatorsDetailsTitle
source: Indicators {month}/{year}
be: Паказчыкі {month}/{year}
ru: Показатели {month}/{year}

# roiLabel
source: Return on Investment (ROI)
be: Вяртанне інвестыцый (ROI)
ru: Возврат инвестиций (ROI)

# breakevenPointLabel
source: Breakeven point
be: Пункт бясстратнасці
ru: Точка безубыточности

# quickRatioLabel
source: Quick ratio
be: Каэфіцыент хуткай ліквіднасці
ru: Коэффициент быстрой ликвидности

# returnOnAssetsLabel
source: Return on assets
be: Рэнтабельнасць актываў
ru: Рентабельность активов

# debtLoadLabel
source: Debt load
be: Даўгавая нагрузка
ru: Долговая нагрузка

# currentRatioLabel
source: Current ratio
be: Бягучы каэфіцыент ліквіднасці
ru: Текущий коэффициент ликвидности

# returnOnSalesLabel
source: Return on sales
be: Рэнтабельнасць продажаў
ru: Рентабельность продаж

# autonomyRatioLabel
source: Autonomy ratio
be: Каэфіцыент аўтаноміі
ru: Коэффициент автономии

# royaltyPaymentLabel
source: Royalty payment
be: Плацёж раялці
ru: Платеж роялти

# netCashFlowLabel
source: Net cash flow
be: Чысты грашовы паток
ru: Чистый денежный поток

# newFinancialReportTitle
source: New financial report
be: Новая фінансавая справаздача
ru: Новый финансовый отчет

# submitReportButton
source: Submit report
be: Адправіць справаздачу
ru: Отправить отчет

# requiredFieldError
source: Required field
be: Абавязковае поле
ru: Обязательное поле

# invalidNumberError
source: Enter a valid number
be: Увядзіце сапраўднае лік
ru: Введите действительное число

# invalidNumberFormatError
source: Invalid number format
be: Несапраўдны фармат ліку
ru: Недействительный формат числа

# reportSubmittedSuccess
source: Report submitted successfully
be: Справаздача паспяхова адпраўлена
ru: Отчет успешно отправлен

# dataError
source: Data error: {error}
be: Памылка дадзеных: {error}
ru: Ошибка данных: {error}

source: Please log in
be: Калі ласка, увайдзіце
ru: Пожалуйста, войдите

# createFranchiseTitle
source: Create Franchise
be: Стварыць франшызу
ru: Создать франшизу

source: Franchise sent for moderation
be: Франшыза адпраўлена на мадэрацыю
ru: Франшиза отправлена на модерацию

# nameLabel
source: Name
be: Назва
ru: Название

# descriptionLabel
source: Description
be: Апісанне
ru: Описание

# industryLabel
source: Industry
be: Галіна
ru: Отрасль

# cityLabel
source: City
be: Горад
ru: Город

# startupCostLabelfirst
source: Startup Cost (RUB)
be: Стартовые затарты (RUB)
ru: Стартовые затраты (RUB)

# royaltyPercentLabel
source: Royalty (%)
be: Раялці (%)
ru: Роялти (%)

# royaltyPercentLabelFranchise
source: Royalty Percent (%)
be: Працэнт раялці (%)
ru: Процент роялти (%)

# nameRequiredError
source: Name is required
be: Назва абавязковая
ru: Название обязательно

# descriptionRequiredError
source: Description is required
be: Апісанне абавязковае
ru: Описание обязательно

# industryRequiredError
source: Industry is required
be: Галіна абавязковая
ru: Отрасль обязательна

# cityRequiredError
source: City is required
be: Горад абавязковы
ru: Город обязателен

# startupCostRequiredError
source: Startup cost is required
be: Пачатковыя выдаткі абавязковыя
ru: Стартовые затраты обязательны

# invalidStartupCostError
source: Enter a valid number
be: Увядзіце сапраўднае лік
ru: Введите действительное число

# royaltyPercentRequiredError
source: Royalty percent is required
be: Працэнт раялці абавязковы
ru: Процент роялти обязателен

# invalidRoyaltyPercentError
source: Enter a valid percentage (0-100)
be: Увядзіце сапраўдны працэнт (0-100)
ru: Введите действительный процент (0-100)

# submitForModerationButton
source: Submit for Moderation
be: Адправіць на мадэрацыю
ru: Отправить на модерацию

# searchHint
source: Search
be: Пошук
ru: Поиск

# findPerfectFranchise
source: Find Your Perfect Franchise
be: Знайдзіце сваю ідэальную франшызу
ru: Найдите свою идеальную франшизу

# exploreOpportunities
source: Explore top opportunities
be: Даследуйце лепшыя магчымасці
ru: Исследуйте лучшие возможности

# exploreFranchiseTitle
source: Explore Our Franchise
be: Даследуйце нашу франшызу
ru: Исследуйте нашу франшизу

source: No franchises available
be: Франшызы адсутнічаюць
ru: Франшизы отсутствуют

# franchiseOverviewTitle
source: Franchise Overview
be: Агляд франшызы
ru: Обзор франшизы

# chatFailedError
source: Failed to start chat: {error}
be: Не ўдалося пачаць чат: {error}
ru: Не удалось начать чат: {error}

# currentUserNotFoundError
source: Current user not found
be: Бягучы карыстальнік не знойдзены
ru: Текущий пользователь не найден

# franchiseOwnerNotFoundError
source: Franchise owner not found
be: Уладальнік франшызы не знойдзены
ru: Владелец франшизы не найден

# youAreFranchiseOwnerError
source: You are the franchise owner
be: Вы з'яўляецеся ўладальнікам франшызы
ru: Вы являетесь владельцем франшизы

# respondNowButton
source: Respond Now
be: Адказаць зараз
ru: Ответить сейчас

# myFranchisesTitle
source: My Franchises
be: Мае франшызы
ru: Мои франшизы

# noFranchisesYet
source: You don't have any franchises yet.
be: У вас пакуль няма франшыз.
ru: У вас пока нет франшиз.

# moderationTitle
source: Moderation
be: Мадэрацыя
ru: Модерация

source: No pending franchise requests
be: Няма запытаў на франшызы
ru: Нет заявок на франшизы

source: No pending branch requests
be: Няма запытаў на філіялы
ru: Нет заявок на филиалы

# branchModerationSuccess
source: Branch moderation successful
be: Мадэрацыя філіяла паспяховая
ru: Модерация филиала успешна

# franchiseModerationSuccess
source: Franchise moderation successful
be: Мадэрацыя франшызы паспяховая
ru: Модерация франшизы успешна

# createdAtLabel
source: Created At: {createdAt}
be: Створана: {createdAt}
ru: Создано: {createdAt}

# franchiseStatusLabel
source: Status: {status}
be: Статус: {status}
ru: Статус: {status}

# franchiseOwnerIdLabel
source: Owner ID: {ownerId}
be: ID уладальніка: {ownerId}
ru: ID владельца: {ownerId}

# franchiseLabel
source: Franchise
be: Франшыза
ru: Франшиза

# locationLabel
source: Location
be: Месцазнаходжанне
ru: Местоположение

# workingHoursLabel
source: Working Hours
be: Гадзіны працы
ru: Часы работы

# phoneLabel
source: Phone
be: Тэлефон
ru: Телефон

# branchStatusLabel
source: Status
be: Статус
ru: Статус

# branchRequestedByLabel
source: Requested by
be: Запрошана: {requesterId}
ru: Запрошено: {requesterId}
